OpenFOAM-v2112-AD/tutorials/verificationAndValidation/atmosphericModels/atmFlatTerrain/successor/setups.orig/common/constant/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

pressureGradient
{
    type                vectorSemiImplicitSource;
    selectionMode       all;
    volumeMode          specific;
    injectionRateSuSp
    {
        U ((0 1.978046e-03 0) 0);
    }
}

atmCoriolisUSource1
{
    type               atmCoriolisUSource;
    atmCoriolisUSourceCoeffs
    {
        selectionMode   all;
        Omega           (0 0 5.65156e-5);
    }
}

atmAmbientTurbSource1
{
    type                atmAmbientTurbSource;
    atmAmbientTurbSourceCoeffs
    {
        selectionMode   all;
        kAmb            1.0e-04;
        epsilonAmb      7.208e-08;
    }
}

atmBuoyancyTurbSource1
{
    type                atmBuoyancyTurbSource;
    atmBuoyancyTurbSourceCoeffs
    {
        selectionMode   all;
        rho             rho;
        Lmax            41.0;
        beta            3.3e-03;
    }
}

atmLengthScaleTurbSource1
{
    type                atmLengthScaleTurbSource;
    atmLengthScaleTurbSourceCoeffs
    {
        selectionMode   all;
        Lmax            41.0;
        n               3.0;
    }
}


// ************************************************************************* //
